[
  {
    "image": "https://i.ibb.co.com/pjfxwpZ5/task-Manager.webp",
    "title": "TaskMaster",
    "companyName": "Productive Labs",
    "id": 1,
    "description": "TaskMaster is your intelligent productivity partner designed to help you plan, prioritize, and complete daily work with confidence. It provides a simple, elegant interface that makes creating and organizing tasks fast and intuitive. You can create projects, add subtasks, set deadlines, and attach notes or files for each item. Smart reminders and adaptive scheduling ensure you never miss important tasks while the built-in analytics show where your time goes. Collaboration features allow teams to assign responsibilities, leave comments, and track progress in real time. Offline access and seamless cloud sync keep your data available even without an internet connection. Security features ensure your personal and team data remain private and encrypted.",
    "size": 45,
    "reviews": 1280,
    "ratingAvg": 4.6,
    "downloads": 1520000,
    "ratings": [
      { "name": "1 star", "count": 32 },
      { "name": "2 star", "count": 44 },
      { "name": "3 star", "count": 102 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 802 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/23GV5tjH/5-SLG2s107u-PPgbkj-Fs-Kxd-EMI8-P85-FDx-Zz-Z2l-Xsry-Bx-P3-Dhc-H49-ILOt-W7verzg-V6-Xoavz.png",
    "title": "FitTrack",
    "companyName": "Healthify Inc",
    "id": 2,
    "description": "FitTrack is a full-featured fitness app that blends workout tracking, nutrition logging, and recovery guidance into one experience. The app learns from your history to suggest personalized workouts and daily calorie goals tailored to your lifestyle. It integrates with popular wearables to capture heart rate, steps, and sleep metrics automatically. Guided video workouts and step-by-step plans make it simple for users at all fitness levels to follow expert routines. The community challenges and leaderboards create motivation and social accountability. Data visualizations show progress over weeks and months, while reminders and habit streaks help build consistent routines. Built-in coaching tips and AI suggestions help refine your plan as you improve.",
    "size": 52,
    "reviews": 3180,
    "ratingAvg": 4.8,
    "downloads": 5035000,
    "ratings": [
      { "name": "1 star", "count": 85 },
      { "name": "2 star", "count": 112 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 425 },
      { "name": "5 star", "count": 2338 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zhbqhBfN/f3ej-Hit0-Za-O2-R3f1-U0-Uc-FPCSE43-Np-Q4ye-Gmfw-VX75z-KV-2-DDn-VQTNL4-Uin4-ZWka-GYr90.png",
    "title": "NoteEase",
    "companyName": "SmartDesk Studio",
    "id": 3,
    "description": "NoteEase is a modern note-taking app built for capturing ideas quickly and organizing knowledge effectively. It supports text, images, audio recordings, and sketches, letting you record thoughts in the format that suits you best. Powerful tagging, folders, and search capabilities make it easy to find notes when you need them. The app syncs securely across devices so your notes are available on mobile and desktop. An optional AI summary feature distills long notes into key points for fast review. For teams, shared notebooks and real-time collaboration simplify project documentation. Fine-grained export options let you save and share notes as PDFs or Markdown for use outside the app.",
    "size": 28,
    "reviews": 2210,
    "ratingAvg": 4.4,
    "downloads": 2012000,
    "ratings": [
      { "name": "1 star", "count": 62 },
      { "name": "2 star", "count": 92 },
      { "name": "3 star", "count": 255 },
      { "name": "4 star", "count": 610 },
      { "name": "5 star", "count": 1191 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WWHG1SxZ/j5k-C50-K3-uw-XDHJKm-I73-KKLsvn3o-An2-Ps7-TV-7-UDnp9-X-f6-Y-8h-O-NFNvl26gc-Frp-E.png",
    "title": "BudgetPal",
    "companyName": "FinSync Technologies",
    "id": 4,
    "description": "BudgetPal helps you understand and control your finances by turning complex budgets into simple actionable steps. It connects to your accounts to categorize transactions automatically and shows trends in spending so you can spot savings opportunities. You can create multiple budgets, set targets, and receive alerts when you get close to limits. Useful visualizations make monthly and yearly comparisons easy, and clear reports provide insight into where your money flows. The app includes savings goals, bill reminders, and suggestions to reduce unnecessary subscriptions. BudgetPal values data privacy and stores financial data with robust encryption. Expert-written guides help users learn financial planning basics and build healthier money habits.",
    "size": 39,
    "reviews": 915,
    "ratingAvg": 4.3,
    "downloads": 1215000,
    "ratings": [
      { "name": "1 star", "count": 41 },
      { "name": "2 star", "count": 53 },
      { "name": "3 star", "count": 165 },
      { "name": "4 star", "count": 287 },
      { "name": "5 star", "count": 369 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zWTR8htY/T0-ELxdc-TQ7-Tg-6-H8m-Fj8rr-Iher-EY29-BOQq-Mle-FUGb-Yu-Sx-E4ars-Ipy-Kn-3gvdq5-NFag.png",
    "title": "PhotoVerse",
    "companyName": "PixelCraft",
    "id": 5,
    "description": "PhotoVerse is a professional-grade photo editor packed into a beautifully designed mobile experience. It offers non-destructive editing, layer support, advanced color controls, and a large library of creative filters and overlays. The AI-powered auto-enhance can adjust exposure, contrast, and color balance with a single tap while manual controls remain available for creative precision. PhotoVerse supports RAW files and gives photographers the flexibility to export high-quality images for print or web. Built-in tutorials and template presets help users create consistent visual styles quickly. For collaboration, teams can share projects and comment on edits in real time. Regular content packs and community challenges keep creative inspiration flowing.",
    "size": 78,
    "reviews": 5450,
    "ratingAvg": 4.7,
    "downloads": 8560000,
    "ratings": [
      { "name": "1 star", "count": 152 },
      { "name": "2 star", "count": 185 },
      { "name": "3 star", "count": 403 },
      { "name": "4 star", "count": 1008 },
      { "name": "5 star", "count": 3702 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/yBnPfrC7/images-q-tbn-ANd9-Gc-QQi-JMv-DW-Ag-Cyoe-Vj-FAREJr-UV6-NLq-Ys-UAfg-Q-s.png",
    "title": "CookEasy",
    "companyName": "HomeChef Labs",
    "id": 6,
    "description": "CookEasy is an all-in-one recipe and meal planning app for home cooks of any skill level. Browse thousands of chef-tested recipes, filter by dietary preferences, and generate automatic shopping lists based on your weekly menu. Step-by-step guided cooking mode keeps your hands free while the app talks you through each stage and timers keep things on schedule. CookEasy learns your favorite flavors and suggests personalized recipes, helping reduce food waste with portion calculators. Nutrition labels are available for every recipe, and you can sync favorites across devices. The app includes video tutorials from professional chefs and an active community sharing tips and adaptations. Offline access ensures recipes are always available at the stove.",
    "size": 40,
    "reviews": 1920,
    "ratingAvg": 4.5,
    "downloads": 2124000,
    "ratings": [
      { "name": "1 star", "count": 52 },
      { "name": "2 star", "count": 74 },
      { "name": "3 star", "count": 198 },
      { "name": "4 star", "count": 558 },
      { "name": "5 star", "count": 1038 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Tx2b3QWW/S5c-HQc3-S-id-ZUy-Htxxup7-Pl-Z1mr7kj-YVkui-B8kl-EIqm2-Odot-Hk-K1-Dwyym-Hor-MDSbc.png",
    "title": "TravelMate",
    "companyName": "GlobeTrek",
    "id": 7,
    "description": "TravelMate is a smart travel planner that helps you discover destinations, compare accommodations, and build complete itineraries in minutes. The app offers curated suggestions based on your interests—food, adventure, culture—and provides local tips from experienced travelers. You can manage bookings, store travel documents, and sync itineraries offline for use without roaming. Real-time price alerts and fare tracking help you find the best deals on flights, while built-in maps show points of interest with estimated travel times. TravelMate supports collaborative planning so friends can contribute to the same trip. Safety features include local emergency contacts and travel advisories. After each trip, TravelMate generates a beautiful recap with photos and highlights.",
    "size": 62,
    "reviews": 4140,
    "ratingAvg": 4.6,
    "downloads": 6720000,
    "ratings": [
      { "name": "1 star", "count": 121 },
      { "name": "2 star", "count": 152 },
      { "name": "3 star", "count": 301 },
      { "name": "4 star", "count": 811 },
      { "name": "5 star", "count": 2755 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TM4VNG36/fyjv-TVsbh-Rk-Uky5be-Amv-BStzj-Gdf-GHn-Fpik0-I1-Qck71-BKn-Hiblf-Nz-FY4i-XXb-IOka0.png",
    "title": "MindFlow",
    "companyName": "Zen Labs",
    "id": 8,
    "description": "MindFlow is a meditation and mindfulness app focused on improving mental clarity and stress resilience. It provides guided meditations, breathing exercises, and sleep stories to help users unwind and sleep better. Programs are tailored by experience level and intended outcomes such as stress reduction, focus improvement, or better sleep quality. Daily streaks and gentle reminders encourage small, sustainable habits without pressure. The app features mood tracking and progress reports that visualize long-term benefits. MindFlow also includes short micro-practices for busy moments and workplace-focused sessions to help teams reduce burnout. The app prioritizes privacy, with all sensitive user data securely stored and never shared without consent.",
    "size": 33,
    "reviews": 2830,
    "ratingAvg": 4.9,
    "downloads": 4920000,
    "ratings": [
      { "name": "1 star", "count": 42 },
      { "name": "2 star", "count": 63 },
      { "name": "3 star", "count": 105 },
      { "name": "4 star", "count": 405 },
      { "name": "5 star", "count": 2215 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/dwjkdn8V/7-BF3-MO-sq0-XPd-JDz-QQv0olj-I4-vs-Bfz-IKZ5-JG8-Uvf7b-FLRj-Egbs9deq-Bvywvu9-Scqmc-w240-h480-rw.webp",
    "title": "Chatly",
    "companyName": "TalkTech",
    "id": 9,
    "description": "Chatly is a secure messaging platform built for speed, privacy, and customization. It offers encrypted conversations, rich media sharing, and theme support for personalizing the chat experience. Powerful search and message pinning make retrieving important information easy, and custom notifications ensure you never miss urgent messages. Group features are optimized for both social and work use, with roles, moderation tools, and shared files. The app prioritizes low bandwidth use so conversations stay snappy on slow networks. Sync across desktop and mobile devices keeps your history available wherever you are. Chatly also supports bots and integrations to automate common tasks inside chats.",
    "size": 58,
    "reviews": 10050,
    "ratingAvg": 4.8,
    "downloads": 20030000,
    "ratings": [
      { "name": "1 star", "count": 305 },
      { "name": "2 star", "count": 412 },
      { "name": "3 star", "count": 705 },
      { "name": "4 star", "count": 1828 },
      { "name": "5 star", "count": 6800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4Z46cMwM/B0-Qa-ELq-T-qwwqpbz-YMyg-C3-ZRoo-9xf-Hls0-NKIuk-hjx-O0-U0l-JHiy-C8r-BU9-Hgw-w240-h480-rw.webp",
    "title": "Weatherly",
    "companyName": "SkyVision Apps",
    "id": 10,
    "description": "Weatherly brings accurate forecasts and live radar to your fingertips with a clean and easy-to-read layout. The app provides hourly and daily forecasts, severe weather alerts, and interactive maps with radar and satellite overlays. Custom widgets allow quick glanceable information on your home screen while location-aware notifications keep you ahead of storms. Weatherly also includes beach, skiing, and running forecasts for outdoor enthusiasts and provides pollen counts for allergy sufferers. Data sources are aggregated from multiple providers to ensure reliability. The app supports both metric and imperial units and stores user-preferred locations for fast access. Weatherly's interface is optimized to present dense meteorological information in a calming, intuitive way.",
    "size": 49,
    "reviews": 1520,
    "ratingAvg": 4.2,
    "downloads": 3032000,
    "ratings": [
      { "name": "1 star", "count": 92 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 305 },
      { "name": "4 star", "count": 452 },
      { "name": "5 star", "count": 551 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/3yV8gYvG/j9-I1u-Iwlyj-AWZHCk-Euya-VBi9r5j-HRsxn1-LQq-MZKsy18-Jx-Im-O6jo-Uu4lx-S0z-BBe-zg-w240-h480-rw.webp",
    "title": "Language Loop",
    "companyName": "LinguaWorks",
    "id": 11,
    "description": "Language Loop makes language learning engaging by combining bite-sized lessons, spaced repetition, and real conversation practice. Lessons include listening, speaking, and cultural notes so learners build practical skills alongside grammar. The app adapts to your pace and presents vocabulary in context to improve retention. Live practice sessions with tutors and community exchange features let you apply what you learn immediately. Progress analytics help identify areas of improvement while daily streaks build consistent habits. Language Loop supports dozens of languages and offers specialized tracks for travel, business, or exams. Offline mode and downloadable lesson packs make learning possible even without connectivity.",
    "size": 36,
    "reviews": 870,
    "ratingAvg": 4.5,
    "downloads": 9800000,
    "ratings": [
      { "name": "1 star", "count": 28 },
      { "name": "2 star", "count": 36 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 210 },
      { "name": "5 star", "count": 476 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/FQrMqF7/Out-Ajz8l-MN0-Ll-DF9-FRm-BAm-IHOh2-Iw-tv-FUxm0-Fh-Vg-Mu6l0r-WMo-Czd-Vw-V-yanb-Tfxqw-w240-h480-rw.webp",
    "title": "ShopEasy",
    "companyName": "QuickCart",
    "id": 12,
    "description": "ShopEasy streamlines online shopping by aggregating deals from multiple retailers into one simple interface. Search and filter products with ease, compare prices, and set price drop alerts to buy at the best time. The app includes a universal cart and coupon finder that applies savings at checkout. Personalized recommendations surface items based on your browsing and purchase history, while wishlists make it easy to track future buys. Secure payment options and order tracking keep your purchases safe and transparent. ShopEasy prioritizes fast performance and clean UI to make shopping efficient and satisfying. Customer reviews and seller ratings help you make informed decisions.",
    "size": 60,
    "reviews": 6400,
    "ratingAvg": 4.3,
    "downloads": 4700000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 720 },
      { "name": "4 star", "count": 1750 },
      { "name": "5 star", "count": 3470 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/G3VLH34V/QNp-ze-N52-NTDLd-R6k9-Xz8-OQ5-E63bk2b29-EJKJMRjxbb-Rqp2op6-Cf-Zp-C7-SS-g-Dxadc-X8.png",
    "title": "LearnLoop",
    "companyName": "EdGrowth",
    "id": 13,
    "description": "LearnLoop is an education platform designed to make skill-building consistent and fun with interactive lessons and project-based learning. Courses span topics from coding and design to marketing and business analytics. Practical assignments and peer reviews help learners apply knowledge and build portfolios. The platform includes mentor sessions and community groups to support motivation and accountability. LearnLoop tracks your progress with competency milestones and recommends next steps tailored to your goals. Offline viewing and downloadable resources are available for learners on the go. Certificates and shareable project links help showcase your achievements professionally.",
    "size": 72,
    "reviews": 2200,
    "ratingAvg": 4.6,
    "downloads": 1450000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 310 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1180 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nMbQn9Vc/3-WYiw-qy-Ar-An9-EAf-Nxc1-Qrr-Eod-92-Pj2-AC6v6t-RXtc-Rz-Mihuv0q-PKV4s-HZw-CW7-Ae-A-w240-h480-rw.webp",
    "title": "VoiceNotes Pro",
    "companyName": "Speakly",
    "id": 14,
    "description": "VoiceNotes Pro turns voice recordings into organized, searchable notes with smart transcription and tagging. The app supports multiple languages and speaker separation for clear meeting minutes. You can highlight timestamps, add textual annotations, and export summaries or full transcripts for distribution. Built-in noise reduction and microphones settings produce quality audio in different environments. For professionals, integrations with calendars and task managers help convert action items into tasks quickly. The AI summary tool extracts key points and next steps to expedite post-meeting follow-up. Encryption and secure sharing keep sensitive discussions private during collaboration.",
    "size": 30,
    "reviews": 970,
    "ratingAvg": 4.4,
    "downloads": 860000,
    "ratings": [
      { "name": "1 star", "count": 22 },
      { "name": "2 star", "count": 34 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 270 },
      { "name": "5 star", "count": 564 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nNWF5J3J/o99-4tv-IB804l-N1qi4bj629w0sar0m-X1-XLQc-GTa-QJ2-J04pe-Qr-MHt-Z0hp-7d-Nn-UMYuene-w240-h480-rw.webp",
    "title": "GardenBuddy",
    "companyName": "GreenThumb",
    "id": 15,
    "description": "GardenBuddy helps gardeners of all levels plan, monitor, and grow healthy plants with confidence. The app offers planting calendars, watering reminders, and pest-detection tips tailored to local climate and plant type. An identification feature uses photos to diagnose plant issues and suggest remedies. Journal tools let you track growth stages with photos and notes, while community forums connect you with local gardening enthusiasts. GardenBuddy also recommends seasonal tasks and fertilizer schedules to optimize yields. Offline mode keeps reference guides accessible in the garden, and premium content includes expert webinars and plant care plans. The app fosters sustainable practices and encourages biodiversity through native-plant suggestions.",
    "size": 22,
    "reviews": 430,
    "ratingAvg": 4.5,
    "downloads": 540000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 18 },
      { "name": "3 star", "count": 60 },
      { "name": "4 star", "count": 130 },
      { "name": "5 star", "count": 212 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MyG486vC/images-q-tbn-ANd9-Gc-QGx-Jy-CV-B1-Nrb542bf-BAus3-QCp-Hu-H8-KOUAaw-s.png",
    "title": "DriveSafe",
    "companyName": "AutoSense",
    "id": 16,
    "description": "DriveSafe is an intelligent driving assistant that helps you stay safer on the road with real-time alerts and trip analytics. It monitors driving behavior using phone sensors or OBD-II integrations to detect hard braking, rapid acceleration, and distracted driving. Trip summaries show distance, fuel efficiency, and suggested maintenance based on usage patterns. Emergency features can automatically alert contacts in a severe collision scenario, while location sharing makes it easy to meet friends or family. The app includes route optimization and traffic-aware ETA predictions to minimize delays. Fleet managers can use admin dashboards for driver scoring and compliance reporting. DriveSafe emphasizes privacy, storing sensitive telematics securely and offering opt-in data sharing.",
    "size": 34,
    "reviews": 1390,
    "ratingAvg": 4.1,
    "downloads": 920000,
    "ratings": [
      { "name": "1 star", "count": 58 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 320 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 302 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N25LML08/512x512bb.jpg",
    "title": "FocusTimer",
    "companyName": "Concentrate Co.",
    "id": 17,
    "description": "FocusTimer uses proven work/rest cycles to help users concentrate and avoid burnout with customizable Pomodoro-style timers. Sessions can be tailored with different lengths and break patterns for deep work or lighter tasks. Ambient soundscapes and gentle fade-in timers provide a calm environment for sustained focus. Session histories track productivity trends and allow you to celebrate streaks and achievements. Integration with task managers means you can start a focused session linked to a specific task, keeping context consistent. The app supports groups and Accountability Circles for shared focus sessions with colleagues. Lightweight and distraction-free, FocusTimer is designed for both students and professionals aiming to build consistent habits.",
    "size": 12,
    "reviews": 540,
    "ratingAvg": 4.7,
    "downloads": 870000,
    "ratings": [
      { "name": "1 star", "count": 8 },
      { "name": "2 star", "count": 12 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 150 },
      { "name": "5 star", "count": 330 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WvKK5qMw/1200x630wa.png",
    "title": "PocketScanner",
    "companyName": "Scanly",
    "id": 18,
    "description": "PocketScanner turns your phone into a portable document scanner with automatic edge detection and OCR. Capture receipts, contracts, and notes quickly, then export them as searchable PDFs. Built-in cloud integration syncs documents securely across devices and simplifies organization with tags and folders. The OCR engine extracts text with high accuracy for easy editing or copying. For teams, shared folders and permission controls make collaboration seamless. Advanced options include batch scanning, background upload, and password-protected documents to keep sensitive files safe. PocketScanner focuses on speed and reliability to streamline administrative tasks for professionals and students alike.",
    "size": 16,
    "reviews": 760,
    "ratingAvg": 4.5,
    "downloads": 1120000,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 34 },
      { "name": "3 star", "count": 95 },
      { "name": "4 star", "count": 200 },
      { "name": "5 star", "count": 411 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/t6PXGT9/512x512bb.jpg",
    "title": "TuneWave",
    "companyName": "RhythmWorks",
    "id": 19,
    "description": "TuneWave is a music discovery and streaming app that emphasizes personalized radio stations and mood-based playlists. The recommendation engine learns your taste quickly and surfaces music you’ll love from emerging artists and mainstream favorites. Disco-style curated mixes and daily playlists keep your listening fresh, while offline downloads make travel listening easy. Social features allow you to share tracks and collaboratively build playlists with friends. High-quality streaming and adaptive bitrate ensure smooth playback across network conditions. The app includes lyric integration and artist bios for deeper listening experiences. TuneWave also supports podcast discovery and cross-content recommendations to broaden audio engagement.",
    "size": 66,
    "reviews": 2840,
    "ratingAvg": 4.6,
    "downloads": 4200000,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 110 },
      { "name": "3 star", "count": 420 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1420 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DPVSRKM4/p-Hl-XT9p-Ae2hx-OKf4-IPLU3ss-WYZ2t6-28-VT5-JJq-Bb8-I7-Wf-Sl-F8-BU3-Mv-Ll7j-YQFnpx-Q.png",
    "title": "SafeHome",
    "companyName": "SecureLiving",
    "id": 20,
    "description": "SafeHome is a home security companion that integrates cameras, sensors, and smart locks into one manageable app. Live video streaming with motion detection and instant mobile alerts enhance peace of mind for homeowners. The app includes geofencing features to automatically arm or disarm systems based on your location, reducing false alarms. Two-way audio and smart automations allow remote interaction and control of devices. SafeHome supports multiple user profiles with role-based permissions for family members and trusted guests. Cloud recordings and local backup options make sure footage is available when needed. Easy setup wizards and manufacturer integrations simplify adding new devices.",
    "size": 55,
    "reviews": 1260,
    "ratingAvg": 4.2,
    "downloads": 980000,
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 95 },
      { "name": "3 star", "count": 310 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 365 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/3Y7HQrtf/appicon.png",
    "title": "MovieScout",
    "companyName": "CineFind",
    "id": 21,
    "description": "MovieScout is a movie discovery and planner app that helps you find films, showtimes, and personalized recommendations. It aggregates reviews, trailers, and critic scores to help you decide what to watch. You can build watchlists, follow favorite directors, and get notified about new releases and local screenings. Social features include shared lists and friend recommendations to coordinate group nights. The app supports ticket purchasing and seat selection for supported theaters. MovieScout also features curated editorial lists and themed collections for inspiration. Robust filters let users search by genre, release year, actor, or mood.",
    "size": 48,
    "reviews": 1780,
    "ratingAvg": 4.4,
    "downloads": 2100000,
    "ratings": [
      { "name": "1 star", "count": 65 },
      { "name": "2 star", "count": 88 },
      { "name": "3 star", "count": 320 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 807 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Cs7YGZWq/Uq-HPGLk-Krzuy-T9-Hj27yw-TDBokooxp9jk-Z1mvm35-YDI9-No6-Qk-LEJl-Z5gx-Yj-P9v-LNE9-Pc-w240-h480-rw.webp",
    "title": "CryptoPulse",
    "companyName": "BlockSight",
    "id": 22,
    "description": "CryptoPulse provides real-time cryptocurrency prices, portfolio tracking, and actionable market insights for traders and investors. The app supports multi-exchange data aggregation to ensure accurate pricing and liquidity information. Customizable alerts notify you of price movements or portfolio thresholds, and advanced charting tools enable technical analysis on the go. Secure wallet integrations and watchlists help manage holdings with clarity. News feeds and sentiment indicators keep you informed about events that could impact markets. CryptoPulse also offers tax reporting tools and exportable transaction histories. User security features include two-factor authentication and encrypted local storage of sensitive data.",
    "size": 26,
    "reviews": 2050,
    "ratingAvg": 4.1,
    "downloads": 1800000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 190 },
      { "name": "3 star", "count": 520 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/kgVy4fjT/pq-Ccp-Ffh2az-OIXPAARb-Djbx-LWOw-Lx-JYJCf-Fl-N0-VErg1-HNTr-Xi9vzm-R1e0-ITCLt-Dn-H-E-w240-h480-rw.webp",
    "title": "KidsLearn",
    "companyName": "BrightStart",
    "id": 23,
    "description": "KidsLearn is a playful educational app for young children that blends games with foundational learning in literacy and numeracy. Colorful interactive activities and progress badges keep children engaged while tracking developmental milestones for parents. The app adapts content difficulty based on performance to build confidence and mastery. Parental controls let caregivers manage screen time and monitor learning progress with clear reports. Familiar characters and storytelling craft context around lessons to encourage curiosity. Offline lesson packs ensure accessibility without continuous connectivity. KidsLearn follows child-safety best practices and anonymizes learner data for privacy.",
    "size": 42,
    "reviews": 690,
    "ratingAvg": 4.7,
    "downloads": 840000,
    "ratings": [
      { "name": "1 star", "count": 12 },
      { "name": "2 star", "count": 18 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 200 },
      { "name": "5 star", "count": 380 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wrxxjSNN/8-RVKTBo-SM6-Qkvw3-VE9t-Bfu-W37i-X4-Sir8x-QFvy-Jzc-NHn96q8-Br-D1-FYKs-Gekc-W9-Pr-A-w240-h480-rw.webp",
    "title": "HabitForge",
    "companyName": "DailyForge",
    "id": 24,
    "description": "HabitForge helps you build consistent habits through small, daily actions reinforced by reminders and progress visuals. The app encourages micro-habits that are easy to start and scale, with habit chains that reward streaks. Detailed analytics show trends and help identify triggers that influence behavior. Community challenges and small-group accountability features make habit-forming social and fun. HabitForge integrates with calendars and health data to provide contextual nudges at the right time. Customizable habit templates make it easy to begin with evidence-based routines. Lightweight notifications and a focus on positive reinforcement keep users motivated without overwhelming them.",
    "size": 14,
    "reviews": 1120,
    "ratingAvg": 4.6,
    "downloads": 1320000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 32 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 723 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xKLBV9j9/huqp-Afe-W-v-Irw-Ju9k-Xxkym-HGt039mk-T0q7wo1v-D7-OZZXyl-T0da82mp-PByol07-Ok-Mp-Mh.jpg",
    "title": "QuizWhiz",
    "companyName": "BrainSpark",
    "id": 25,
    "description": "QuizWhiz is a trivia and learning app that makes studying fun with short timed quizzes and spaced repetition. Users can choose from curated topic packs or create custom quizzes to challenge friends. Performance analytics help identify weak areas and suggest targeted practice. Leaderboards and social sharing provide friendly competition to boost engagement. Teachers can create classroom groups and track student progress with batch reporting tools. Offline mode and downloadable quiz sets support learning without internet access. Frequent content updates and community-created packs keep the question bank fresh and varied.",
    "size": 18,
    "reviews": 950,
    "ratingAvg": 4.5,
    "downloads": 1020000,
    "ratings": [
      { "name": "1 star", "count": 18 },
      { "name": "2 star", "count": 26 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 486 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8D4KtD2R/gye6u-J4ga-Vhy1ti-Llxnyz-YAYbf-Yeoc-Q29-B861-Ae-Sjd-H6-MHw-V2cf-Fy-GVSk-MEHAkm-Im-GRdhz-Ar-g-s900-c.jpg",
    "title": "ArtBoard",
    "companyName": "SketchWorks",
    "id": 26,
    "description": "ArtBoard is a mobile sketching studio for artists who want powerful brushes and layer controls on the go. The app supports pressure-sensitive strokes on compatible devices and a large library of customizable brushes. Vector and raster export options let creators choose formats for web or print, while time-lapse recording features capture the creative process. Collaboration tools enable co-editing canvases and sharing feedback in real time. Tutorials and artist packs help users learn new techniques and expand their skill set. ArtBoard also includes asset libraries and color-palette generation tools to accelerate workflows. For professionals, project management features help organize commissions and client revisions.",
    "size": 90,
    "reviews": 1330,
    "ratingAvg": 4.7,
    "downloads": 1240000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 58 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 602 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/W48pdgvF/Yb-Tl-Da-So-UYbzl-JJlam3g-KSPbu-Wej-Oi-R82d-JDNv-PW1-Sf-Rwb1-K6uac5u-Ral-Mqoqk9v4j-U.png",
    "title": "MarketPulse",
    "companyName": "RetailSense",
    "id": 27,
    "description": "MarketPulse delivers insights for small businesses with sales dashboards, inventory alerts, and customer analytics. The app syncs with POS systems to provide near-real-time reports on sales, stock levels, and best-selling items. Built-in forecasting tools help owners plan orders and allocate promotions effectively. Customer segmentation and loyalty features make it straightforward to run targeted campaigns and reward repeat buyers. Secure multi-store support and role-based access control help scale operations while maintaining security. MarketPulse offers exportable reports and integration with accounting software to streamline bookkeeping. Mobile alerts notify managers about low-stock items or suspicious transactions so they can act quickly.",
    "size": 38,
    "reviews": 680,
    "ratingAvg": 4.4,
    "downloads": 470000,
    "ratings": [
      { "name": "1 star", "count": 22 },
      { "name": "2 star", "count": 26 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 216 },
      { "name": "5 star", "count": 296 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/G3WTG0yk/DJ7-JB6-LBob-Ne-Wq8-FAEG0v-Fi-Fqzc-Am-Lni-Kf-b-Or-IF-p-H5y-UKEuvu-NHTc-SGGVTu-b-QKc.png",
    "title": "PhotoShare",
    "companyName": "SnapCircle",
    "id": 28,
    "description": "PhotoShare is a community-driven photo sharing network focused on high-quality photography and creator monetization. Photographers can upload portfolios, sell prints, and offer tutorials directly to followers. The app supports high-resolution uploads with smart compression for fast delivery and optional watermarking for protection. Curated content sections highlight trending photographers and themed challenges encourage participation. In-app analytics show engagement metrics and revenue breakdowns for creators. PhotoShare offers premium memberships that unlock advanced gallery customization and storefront features. Community moderation tools and clear reporting channels maintain a respectful environment for artists and viewers.",
    "size": 64,
    "reviews": 1750,
    "ratingAvg": 4.5,
    "downloads": 2100000,
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 95 },
      { "name": "3 star", "count": 410 },
      { "name": "4 star", "count": 620 },
      { "name": "5 star", "count": 555 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Y4fjVNsL/a8-VWXvi-QABa-QOw-ACsw-YC3-Ha-PKYIIk-Qt-FGD9u-UMq-h-XYU3-Zh-Ky-JKdy-Cu3-g-X92-M0xt2-M.png",
    "title": "GreenRoutes",
    "companyName": "EcoMap",
    "id": 29,
    "description": "GreenRoutes helps users find eco-friendly travel options, combining route planning with low-emission suggestions. The app compares walking, cycling, public transit, and ride-sharing routes to recommend greener choices and estimated carbon savings. For commuters, optimized mixed-mode routes balance speed and sustainability. Local guides highlight eco-conscious businesses, parks, and community initiatives. GreenRoutes also offers challenges to incentivize low-carbon travel and shares progress with friends to foster community participation. Integration with bike-sharing and scooter networks makes first-mile/last-mile planning seamless. The app aims to make greener commuting easy and measurable for individuals and organizations.",
    "size": 20,
    "reviews": 430,
    "ratingAvg": 4.4,
    "downloads": 520000,
    "ratings": [
      { "name": "1 star", "count": 14 },
      { "name": "2 star", "count": 22 },
      { "name": "3 star", "count": 60 },
      { "name": "4 star", "count": 170 },
      { "name": "5 star", "count": 164 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/F44QLqX2/Ks-W8z-HF1-XAEN-76mnlpvl-Xl3-Up-Qjxon-TMD8jih-Nd-Lp-UTTY0pt-G2-YOd-Iv-1p9-Cczh-FQ.png",
    "title": "RecipeHub",
    "companyName": "CulinaryCloud",
    "id": 30,
    "description": "RecipeHub is a community-driven recipe platform offering thousands of tested recipes, step-by-step guides, and video tutorials. Users can save favorites, build meal plans, and share their own recipes with photos and tips. Ingredient scaling helps adjust portions for family sizes, while shopping-list generation makes grocery trips efficient. RecipeHub features dietary filters for allergies and preferences and suggests weekly menus to reduce decision fatigue. A rating system and user comments provide social proof and variants for each dish. The app emphasizes accessibility with large text modes and voice-guided cooking. Seasonal collections and holiday menus inspire varied and balanced meals year-round.",
    "size": 58,
    "reviews": 2330,
    "ratingAvg": 4.7,
    "downloads": 1950000,
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 540 },
      { "name": "5 star", "count": 1475 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N6Tsm8Z7/lzplg2xncm-Kf-YF1m-LMQs-Cp-Nf-BZZl-R1w-Fmaj-F-Zae8i-QDCA2-I2jmh-OUG2j-MRId-Jd-Rv-Q-w240-h480-rw.webp",
    "title": "FitPlay",
    "companyName": "ActiveFun",
    "id": 31,
    "description": "FitPlay combines gaming elements with fitness routines to create engaging workouts that feel like play. Users earn points and unlock rewards by completing daily challenges and live events. The app includes multiplayer fitness games and cooperative goals to motivate group participation. Personalized difficulty scaling adjusts activities for new and experienced users alike. Motion-tracking features provide feedback on form and intensity for safer progress. In-app coaching provides tips and encouragement to help users reach goals sustainably. FitPlay focuses on joyful movement and community-driven fitness rather than strict metrics alone.",
    "size": 54,
    "reviews": 880,
    "ratingAvg": 4.6,
    "downloads": 1270000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 390 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/pBDCznJk/ZLQSs-VFz-Gl-SG4-Qxnm-Nir-Jn6-Cf-Ca-Ua31q6-I5-Wb-CSMmuah-Lio1lfa-Rqu-F-L-PAZDd3g.png",
    "title": "InvoiceMate",
    "companyName": "BillingWorks",
    "id": 32,
    "description": "InvoiceMate simplifies invoicing and expense tracking for freelancers and small businesses. Create professional invoices in minutes, set recurring billing, and accept payments via integrated gateways. Expense capture via photo receipts and automatic categorization speeds up bookkeeping. The app includes tax summary reports and CSV export for accountants. Multi-currency support and client management features make it suitable for international work. Secure backups and user roles protect sensitive financial data. InvoiceMate includes templates and invoice tracking to reduce late payments and improve cash flow.",
    "size": 24,
    "reviews": 560,
    "ratingAvg": 4.3,
    "downloads": 740000,
    "ratings": [
      { "name": "1 star", "count": 18 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 90 },
      { "name": "4 star", "count": 180 },
      { "name": "5 star", "count": 247 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PGW15SvP/6qk-OIEo-Vt-Km-L0-Jkf-Et5k7a-NRSmco-Tx-Tfpw6a-Hn-U4-JVm-BHhc-Npmei-YIy-Bdo-XULy-PG1-Q-w240-h480-rw.webp",
    "title": "WalkWithMe",
    "companyName": "StepSense",
    "id": 33,
    "description": "WalkWithMe encourages daily movement through friendly step challenges, walk routes, and scenic audio guides. The app integrates with health data to track steps and active minutes while offering personalized daily step goals. Guided walking tours provide local discovery and narration for city exploration. Group walks and neighborhood leaderboards build local community engagement. Challenges with charities allow users to convert activity into social impact. WalkWithMe is lightweight, battery-friendly, and designed for walkers of all ages. Accessibility features include high-contrast modes and large controls for ease of use.",
    "size": 10,
    "reviews": 320,
    "ratingAvg": 4.6,
    "downloads": 540000,
    "ratings": [
      { "name": "1 star", "count": 6 },
      { "name": "2 star", "count": 12 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 110 },
      { "name": "5 star", "count": 152 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8gZY70PW/Sf4w-XGe-FOXGVYb-ACkd-Yk-Jo-BXNNt-Rfa-Zq-UPg-RCkrg-XIBMm-Ktm-Nh-Crk-B6-Jl52-WJ8-IS5m-XW.png",
    "title": "SleepWise",
    "companyName": "RestLabs",
    "id": 34,
    "description": "SleepWise helps users improve sleep quality with personalized programs, sleep tracking, and relaxing soundscapes. It records sleep stages through phone sensors or wearables and delivers suggestions to refine bedtime routines. Guided wind-down sessions and breathing exercises prepare the mind for restful sleep. The app provides smart alarms that wake users during light sleep phases for improved morning alertness. Historical data and trend visualizations help users understand long-term sleep health and identify factors that disrupt rest. Sleep coaching content and sleep hygiene tips support sustainable improvements. Privacy-first data handling ensures sensitive sleep analytics stay under user control.",
    "size": 27,
    "reviews": 1540,
    "ratingAvg": 4.5,
    "downloads": 1150000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 48 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 360 },
      { "name": "5 star", "count": 922 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/k2z5mW9L/Cy-BTEZ-2g-Quae-TZw-Js3-DE3-S-LPw-Q-6e-Y9u-K8-AEw2r-CWb-GQp-EX-c-TXCt-O4-Xc4fuo-RIY.png",
    "title": "HomeFit",
    "companyName": "BodyBeat",
    "id": 35,
    "description": "HomeFit is a home workout app with bodyweight routines, equipment-free HIIT, and customizable training plans that adapt to your progress. Video demonstrations and form tips ensure safe movement while timers and interval modes keep the pace. Integration with smart TVs and chromecast allows workouts on larger screens for guided sessions. The program builder creates weekly schedules and rest days, balancing intensity across sessions. HomeFit includes mobility and stretching plans to reduce injury risk and improve recovery. Community challenges encourage consistency and friendly competition with leaderboards. Nutrition tips and simple meal plans complement workout goals for balanced progress.",
    "size": 47,
    "reviews": 1980,
    "ratingAvg": 4.6,
    "downloads": 1600000,
    "ratings": [
      { "name": "1 star", "count": 38 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 550 },
      { "name": "5 star", "count": 1162 }
    ]
  }
]
